export default {
  comment: {
    c1: '评论',
    c2: '发表'
  },
  scriptInfo: {
    s1: '场景名称',
    s2: '所属目录',
    s3: '添加人',
    s4: '添加时间',
    s5: '更新时间',
    s6: '权限',
    s7: '描述',
    s8: '目录名称',
    s9: '场景数量',
    s10: '添加用户',
    s11: '查看权限',
    s12: '链接',
    s13: '密码',
    s14: '有效期',
    s15: '选择目录',
    s16: '场景性能指标',
    s17: '目标并发(用户数)',
    s18: '平均响应时间(RT)',
    s19: 'TPS/QPS',
    s20: '错误率(ERR)',
    s21: '修改指标',
    s22: '选择协议'
  },
  placeholder: {
    ps: '请选择',
    p1: '删除场景',
    p2: '限制输入{n}字符以内',
    p3: '选择目录'
  },
  tips: {
    t1: '为了让场景中的参数值更加接近真实业务数据，系 统还提供了两种动态取值方式，可根据自己的业 务需求选择参数值的取值方式 。',
    t2: '上传完成',
    t3: '上传失败',
    t4: '复制链接和密码',
    t5: '复制成功',
    t6: '复制失败',
    t7: '删除数据',
    t8: '保存场景成功',
    t9: '添加目录成功',
    t10: '删除【{name}】会删除其子目录和场景，请确认是否删除？',
    t11: '{name}目录下含有子文件，确定一起删除吗',
    t12: '目录删除成功',
    t13: '删除目录',
    t14: '删除场景会同步删除关联关注、收藏、指标、变量等信息，请确认是否删除？',
    t15: '删除{name}场景成功',
    t16: '执行会根据设定的性能指标来判断测试结果是否通过；请谨慎修改配置。',
    t17: '指标修改成功',
    t18: '请选择目录'
  },
  btn: {
    b1: '上传参数文件',
    b2: '已生成参数文件'
  },
  upload: {
    u1: '选择文件',
    u2: '继续上传',
    u3: '确定',
    u4: '取消'
  },
  fileName: '文件名称',
  method: '调用方式',
  source: '来源',
  dataSource: '数据源',
  dataForm: '数据表',
  select: '选择',
  save: '保存',
  file: '文件',
  delete: '删除',
  scenario: '场景',
  export: {
    e1: '导出场景',
    e2: '选择导出方式'
  },
  rules: {
    r1: '场景名称不能为空'
  },
  folder: {
    f1: '添加目录',
    f2: '添加场景',
    f3: 'http场景',
    f4: 'websocket场景'
  },
  home: {
    h0: '在这里您和您的团队可以完成以下工作：',
    h1: '欢迎进入Angus场景！',
    h2: '场景可以帮助您编排更加复杂的需求或用户故事，相比单个步骤的测试用例，场景可以包含更多步骤和流程。',
    h3: '在线添加、编辑、调试场景；',
    h4: '管理我的场景和测试任务；',
    h5: '开展场景功能测试、稳定性和性能测试，保证交付稳定且满足性能指标要求的系统。',
    h6: '目录',
    h7: '场景',
    h8: '执行',
    h9: '目录用于组织测试场景或对有相同特点的测试场景分组，可以是项目名或模块名等。最大支持3级，每个目录的权限相互独立。',
    h10: '在线添加、编辑测试场景；系统默认提供了Http和WebSocket协议场景编排，其他协议或中间件需要进入',
    h11: '“云商店”',
    h12: '安装对应插件。',
    h13: '在场景编排和配置“执行配置”完成后，即可执行对场景进行功能、性能测试、稳定性测试',
    h15: '执行场景'
  },
  executeScript: '执行脚本'
};
