export default {
  title: {
    t1: '可根据自身的网络环境选择适合的代理服务。',
    t2: '无代理',
    t3: '通过浏览器直接请求接口，对非同源访问接口服务器端接口需要取消跨域限制。',
    t4: '客户端代理',
    t5: '需要在访问浏览器所在电脑中安装”代理程序“，配置后将使用客户端代理发送请求。',
    t6: '服务端代理',
    t7: '需要将”代理程序“单独安装在共享网络的服务器主机，使用服务端代理无需用户在各自电脑中安装代理程序，配置后将使用服务端代理发送请求。',
    t8: '下载代理程序',
    t9: 'Windows桌面代理',
    t10: 'Mac桌面代理',
    t11: 'Linux代理',
    t12: '手动安装包',
    t13: '服务代理配置',
    t14: '是否开启：',
    t15: '代理地址：',
    t16: '取消',
    t17: '保存',
    t18: '已连接',
    t19: '未链接',
    t20: '请输入host',
    t21: '请输入端口号,范围1~65535',
    t22: '代理配置修改成功',
    t23: '连接成功',
    t24: '连接失败'
  }
};
