export default {
  title: {
    t1: '脚本总数',
    t2: '功能自动化',
    t3: '性能',
    t4: '稳定性',
    t5: '场景',
    t6: '数据源',
    t7: '脚本名称',
    t8: '脚本类型',
    t9: '来源',
    t10: '关联场景',
    t11: '添加人',
    t12: '添加时间',
    t13: '更新时间',
    t14: '操作',
    t15: '编辑',
    t16: '禁用',
    t17: '删除',
    t18: '导出JSON',
    t19: '导出YAML',
    t20: '脚本管理',
    t21: '脚本详情',
    t22: '编辑脚本',
    t23: '描述',
    t24: '测试脚本',
    t25: '文件脚本',
    t26: '数据源脚本',
    t27: '文件'
  },
  placeholder: {
    ps: '请选择',
    p1: '查询脚本名称',
    p2: '选择脚本类型',
    p3: '选择来源',
    p4: '选择状态',
    p5: '选择添加人'
  },
  tips: {
    t1: '删除脚本',
    t2: '确定删除该脚本吗？',
    t3: '脚本删除成功'
  },
  pageShowTotal: '共{total}条记录,第{pageNo} / {totalPage}页'
};
