export default {
  title: {
    t1: '待推送',
    t2: '成功',
    t3: '失败',
    t4: '推送配置',
    t5: '推送记录',
    t6: '配置接收通道',
    t7: '配置接收人',
    t8: '选择接收方式',
    t9: '选择接收人',
    t10: '接收人',
    t11: '选择其他用户'
  },
  columns: {
    c1: '通知状态',
    c2: '接收通道',
    c3: '发送人',
    c4: '操作',
    c5: '执行编号',
    c6: '添加时间',
    c7: '通知状态',
    c8: '推送时间',
    c9: '推送结果'
  },
  placeholder: {
    p1: '查询执行编号',
    p2: '选择通知状态',
    p3: '选择HTTP(S)地址',
    p4: '选择邮箱',
    p5: '选择钉钉机器人',
    p6: '选择企业微信机器人'
  }
};
